DataProcessors/РабочийСтол.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РабочийСтол</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/РабочийСтол/Forms/НастройкаРабочегоСтола/Ext/Form/Module.bsl
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ЗаполнитьПараметрыПользователя();
	Элементы.Пользователь.ТолькоПросмотр = НЕ РольДоступна("Программист");
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыПользователя()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.Пользователь = &Пользователь
		|	И НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ПолучитьСписокНастроек());
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтаФорма[Выборка.ИмяНастройки] = Выборка.Значение;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьСписокНастроек()

	МассивНастроек = Новый Массив(2);
	
	МассивНастроек[0] = "АдресаДляОтправкиОповещений";
	МассивНастроек[1] = "СвернутыйГантПриОткрытии";
	
    Возврат МассивНастроек;
	
КонецФункции // ПолучитьСписокНастроек()

Процедура СохранитьНаСервере()
	
	Для каждого ИмяНастройки Из ПолучитьСписокНастроек() Цикл
	
		МенеджерРегистра 				= РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
		МенеджерРегистра.ИмяНастройки 	= ИмяНастройки;
		МенеджерРегистра.НомерНастройки = 0;
		МенеджерРегистра.Пользователь  	= Пользователь;
		МенеджерРегистра.Значение 		= ЭтаФорма[ИмяНастройки];
		
		МенеджерРегистра.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура АдресаДляОтправкиОповещенийПриИзменении(Элемент)
	Элементы.ФормаСохранить.Доступность = Истина;
КонецПроцедуры 

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ЗаполнитьПараметрыПользователя()
КонецПроцедуры

&НаКлиенте
Процедура СвернутыйГантПриОткрытииПриИзменении(Элемент)
	Элементы.ФормаСохранить.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура АдресаДляОтправкиОповещенийИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.ФормаСохранить.Доступность = Истина;
КонецПроцедуры
